{
  "match-1-mi-rcb": {
    "newsId": "match-1-mi-rcb",
    "title": "VIVO IPL 2021, MATCH 1 MI VS RCB",
    "datetime": "2021-04-09T15:30:00.000Z",
    "datePublished": "April 9th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/09/d4189aa6-da1a-41af-9132-53b23cdde606/Match01-_00532-1-.JPG?width=2000&height=1333",
    "shortText": "Harshal Patel starred with the ball and scalped a five-wicket haul.",
    "detailedText": "<p>Royal Challengers Bangalore (RCB) kicked off their VIVO Indian Premier League (IPL) 2021 campaign with a 2-wicket win against the Mumbai Indians (MI) on Friday at the M. A. Chidambaram Stadium in Chennai.</p><br/><p>Harshal Patel starred with the ball, picking a fifer and AB de Villiers provided the finishing touch, giving RCB their first win of the season.</p><br/><p>Chris Lynn along with the six-foot-eight-inch left-arm Proteas seamer, Marco Jansen made their respective debuts for MI.</p><br/><p>Chasing a total of 160, Washington Sundar, who opened the batting for the first time in the IPL was dropped off Boult on the second ball of the innings. The RCB skipper Virat Kohli at the other end got off the mark with a leading edge that raced away to the boundary.</p><br/><p>RCB openers started confidently, tackling the pace of Boult and Bumrah, and subsequently attacking the young left-arm pacer, Jansen.</p><br/><p>Krunal Pandya provided the early breakthrough for MI, dismissing Sundar in the 5th over.   Rajat Patidar, who walked in next, hit a boundary before he was knocked over by a beauty from Boult, giving MI their second wicket.</p><br/><p>Maxwell joined skipper Kohli in the middle with RCB trying to rebuild after two wickets falling inside the powerplay.</p><br/><p>Rahul Chahar was introduced into the attack and Glenn Maxwell took the leg-spinner on, perfectly executing his trademark switch hit and later played a lofted drive inside out, producing the same result.</p><br/><p>At the halfway stage, RCB were 75-2 with both Maxwell and Kohli looking settled. In the eleventh over, Maxwell tonked Krunal Pandya for a maximum that went deep into the night sky and out of Chepauk.</p><br/><p>RCB were cruising, thanks to the Big Show and MI were desperately looking for a breakthrough. Jasprit Bumrah was brought back to the attack and he got the job done for the team, dismissing the RCB skipper in the 13th over.</p><br/><p>MI got two timely wickets in quick succession including the wicket of well-settled Maxwell. But AB de Villiers, who was joined by Daniel Christian, got 15 runs off Rahul Chahar, getting RCB closer to the ask, with four overs to go.</p><br/><p>Skipper Rohit Sharma handed over the ball to the best in the business – Jasprit Bumrah and he delivered once again, dismissing Daniel Christian and conceding just 5 runs in the 17th over.</p><br/><p>AB de Villiers kept RCB’s hopes alive after the righthander smashed 15 runs off the 18th over bowled by Boult as well as struck two crucial boundaries against Bumrah in the penultimate over.</p><br/><p>With 3 runs required off the last 3 deliveries, de Villiers ran himself out in an attempt to steal a double but RCB got off the line, winning on the last ball.</p>"
  },
  "match-2-csk-dc": {
    "newsId": "match-2-csk-dc",
    "title": "VIVO IPL 2021, MATCH 2 CSK VS DC",
    "datetime": "2021-04-10T15:30:00.000Z",
    "datePublished": "April 10th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/10/d81783d0-8ae3-49d3-b3df-7a3c6801e90d/IPL21M2_321.JPG?width=2000&height=1333",
    "shortText": "Openers Shikhar Dhawan and Prithvi Shaw’s entertaining knocks helped Delhi Capitals chase down a challenging total with ease.",
    "detailedText": "<p>Delhi Capitals (DC) started their VIVO Indian Premier League (IPL) 2021 campaign with a 7-wicket victory against the Chennai Super Kings (CSK) at the Wankhede Stadium in Mumbai on Saturday.</p><br/><p>Shikhar Dhawan and Prithvi Shaw’s entertaining knocks at the top helped DC chase down a challenging total with ease.</p><br/><p>Although DC were without the services of their core overseas players like Kagiso Rabada and Anrich Nortje, they played some strong backups, with Tom Curran and Chris Woakes making their respective debuts for DC. </p><br/><p>Chasing a challenging target of 189, DC needed an aggressive start from their openers and the pair of Dhawan and Shaw did just that.</p><br/><p>The runs came in very quickly and came off to good cricketing shots. While Dhawan took on Sam Curran from one end, Shaw smacked Shardul Thakur for three boundaries in a row.</p><br/><p>Shaw was picking gaps for fun, his timing and execution was class apart as DC raced off to a total of 65 for no loss at the end of powerplay, putting pressure on the CSK bowling line-up.</p><br/><p>CSK skipper MS Dhoni introduced spin into the attack to put an end to the opening partnership and it nearly provided them a breakthrough but Shaw got a life in the eighth over after he was dropped in the outfield off Moeen Ali’s bowling.</p><br/><p>Shaw continued the demolition while Dhawan, on the other end, kept the runs flowing, timing the ball to perfection as the DC openers brought their respective half centuries in no time.</p><br/><p>DC maintained their run-rate at the end of the 12 overs and the manner in which Dhawan and Shaw were striking the ball, they wanted to finish the game in a hurry.</p><br/><p>It was Dwayne Bravo, who provided the breakthrough for the Chennai Super Kings after Shaw mistimed a wide delivery straight to Moeen Ali in the deep. Hammering 72 off 38 deliveries, the right-hander did his bit to put DC in command.</p><br/><p>Rishabh Pant, who was captaining for the first time in the IPL joined the party after slicing a four to a short and wide delivery bowled by Deepak Chahar, who conceded 12 runs in his last over. </p><br/><p>Meanwhile, Dhawan continued playing with the lines of the bowlers and was simply striking the ball in the gaps. However, after smashing Shardul Thakur for two consecutive fours in the 17th over, he was trapped in front, bringing an end to a thoroughly entertaining innings.</p><br/><p>Pant, though, stayed till the end and finished the chase in style, whipping away the fourth ball of the 19th for a four.</p>"
  },
  "match-3-srh-kkr": {
    "newsId": "match-3-srh-kkr",
    "title": "VIVO IPL 2021, MATCH 3 SRH VS KKR",
    "datetime": "2021-04-11T15:12:24.000Z",
    "datePublished": "April 11th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/11/457bf9f3-8582-43c8-be75-5cc6add299f2/VRP7255.jpg?width=2000&height=1333",
    "shortText": "Fifties from Nitish Rana and Rahul Tripathi set up Kolkata Knight Riders’ 10-run win over Sunrisers Hyderabad.",
    "detailedText": "<p>Kolkata Knight Riders (KKR) registered a victory against Sunrisers Hyderabad (SRH) in Match 3 of the VIVO Indian Premier League (IPL) 2021 at the M. A. Chidambaram Stadium in Chennai on Sunday.</p><br/><p>Fifties from Nitish Rana and Rahul Tripathi powered KKR to a competitive total and the Eoin Morgan-led unit successfully managed to hold their nerves against SRH to seal a 10-run win. </p><br/><p>Chasing a challenging total of 188, the SRH openers were back in the hut before they could attack the new ball. While David Warner nicked one to the keeper off the bowling of Prasidh Krishna, Wriddhiman Saha chopped a Shakib Al Hasan delivery onto the stumps.</p><br/><p>Jonny Bairstow and Manish Pandey played steadily, ending the powerplay with 35 runs on the board. Pandey smashed a six against Shakib over long-off in the seventh over as SRH started to shift gears. Andre Russell, who bowled the next over, gave away 15 runs as Bairstow targeted him, hitting two fours and a six.</p><br/><p>The Bairstow-Pandey duo brought up their fifty-run partnership and continued to score at a brisk pace.</p><br/><p>However, just when it seemed that SRH were positively heading towards the target Pat Cummins dismissed Bairstow to give KKR a vital breakthrough in the 13</span>th</span> over. </p><br/><p>Pandey continued striking the ball and was joined by Mohammad Nabi who smashed two boundaries before mistiming a Prasidh Krishna delivery, giving an easy catch to KKR skipper Eoin Morgan.</p><br/><p>Although Pandey brought up his fifty, SRH required something special at the death in order to chase the total.</p><br/><p>While Vijay Shankar was dismissed slicing the ball straight to Morgan at covers, Abdul Samad smacked two huge sixes off Cummins in the penultimate over.</p><br/><p>But, with SRH needing 22 runs off the last over, Russell held his nerves and helped KKR successfully defend their total.</p>"
  },
  "match-4-rr-pbks": {
    "newsId": "match-4-rr-pbks",
    "title": "VIVO IPL 2021, MATCH 4 RR VS PBKS",
    "datetime": "2021-04-12T15:12:24.000Z",
    "datePublished": "April 12th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/12/0e6d485a-b339-4b6e-aee3-8344ab60833a/DMIPL2689.JPG?width=2000&height=1333",
    "shortText": "Punjab Kings edged out a spirited Rajasthan Royals side and sealed a 4-run win.",
    "detailedText": "<p>Punjab Kings (PBKS) overcame a spirited Rajasthan Royals (RR) challenge, led by a sensational Sanju Samson, and emerged victorious in a high-scoring thriller in Match 4 of the VIVO Indian Premier League (IPL) 2021 at the Wankhede Stadium in Mumbai on Monday.  </p></br><p>PBKS skipper KL Rahul led from the front, with a defining knock of 91 before Arshdeep Singh defended 13 runs in the last over, helping the side seal a 4-run win.  </p></br><p>Chasing a humongous total of 221, RR needed a powerful and explosive start from their openers. But they were denied the same as Mohammad Shami and Arshdeep Singh held on to catches off their own bowling to dismiss Ben Stokes and Manan Vohra respectively.</p></br><p>Samson and Jos Buttler had a mountain of runs to climb, but they didn’t let the pressure of early wickets affect them.</p></br><p>Buttler counter-attacked Riley Meredith in the fourth over, welcoming the right-arm pacer in the IPL with four fours in a row. Sanju Samson then creamed two fours in the sixth over off Arshdeep as RR moved to 59/2 at the end of powerplay.</p></br><p>Jhye Richardson was back into the attack after conceding 13 runs in the first over and managed to get rid of the dangerous-looking Buttler, cleverly deceiving the right-hander with a slower delivery.</p></br><p>The RR skipper though, continued playing his shots with the help of his supreme timing and struck a fifty on his IPL captaincy debut.  </p></br><p>Shivam Dube, who joined Samson, had a short stay at the crease after he holed out into the deep, granting Arshdeep his second wicket of the innings.</p></br><p>With 6 overs to go, Riyan Parag smashed the ball right from ball one, making things easier for his skipper at the other end. There was no shortage of entertainment as the Samson-Parag duo were on a roll, hammering 20 runs off the 16</span>th</span> over bowled by Murugan Ashwin. </p></br><p>With 48 required off the final four overs, skipper Rahul brought Shami back into the attack and the pacer scalped the vital wicket of Riyan Parag in his final over of the match.</p></br><p>There was no stopping the RR skipper though as the right-hander brought up a magnificent century, becoming the first batsman to get a hundred on IPL captaincy debut.</p></br><p>However, PBKS managed to dismiss Rahul Tewatia as Meredith picked his maiden IPL wicket in the penultimate over. </p></br><p>Samson had laid the foundation and now had the challenge to finish the innings for the team with 13 runs required off the final six deliveries.</p></br><p>Arshdeep, who had already scalped two wickets in the match was given the ultimate responsibility to bowl the final over. The left-arm pacer bowled phenomenally and varied his pace to perfection. With 5 runs required off the last ball, Samson sliced the ball in the air, into the deep and Deepak Hooda took a fine running catch, helping PBKS win the nail-biter of a match.</p>"
  },
  "match-5-kkr-mi": {
    "newsId": "match-5-kkr-mi",
    "title": "VIVO IPL 2021, MATCH 5 KKR VS MI",
    "datetime": "2021-04-13T15:12:24.000Z",
    "datePublished": "April 13th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/13/d824214f-f593-417f-b980-3b47648747fa/Match05-_00895.JPG?width=2000&height=1333",
    "shortText": "Rahul Chahar registered his best-bowling figures (4/27) in the IPL as MI successfully defended the total of 152 and beat KKR by 10 runs.",
    "detailedText": "<p>Punjab Kings (PBKS) overcame a spirited Rajasthan Royals (RR) challenge, led by a sensational Sanju Samson, and emerged victorious in a high-scoring thriller in Match 4 of the VIVO Indian Premier League (IPL) 2021 at the Wankhede Stadium in Mumbai on Monday.  </p></br><p>PBKS skipper KL Rahul led from the front, with a defining knock of 91 before Arshdeep Singh defended 13 runs in the last over, helping the side seal a 4-run win.  </p></br><p>Chasing a humongous total of 221, RR needed a powerful and explosive start from their openers. But they were denied the same as Mohammad Shami and Arshdeep Singh held on to catches off their own bowling to dismiss Ben Stokes and Manan Vohra respectively.</p></br><p>Samson and Jos Buttler had a mountain of runs to climb, but they didn’t let the pressure of early wickets affect them.</p></br><p>Buttler counter-attacked Riley Meredith in the fourth over, welcoming the right-arm pacer in the IPL with four fours in a row. Sanju Samson then creamed two fours in the sixth over off Arshdeep as RR moved to 59/2 at the end of powerplay.</p></br><p>Jhye Richardson was back into the attack after conceding 13 runs in the first over and managed to get rid of the dangerous-looking Buttler, cleverly deceiving the right-hander with a slower delivery.</p></br><p>The RR skipper though, continued playing his shots with the help of his supreme timing and struck a fifty on his IPL captaincy debut.  </p></br><p>Shivam Dube, who joined Samson, had a short stay at the crease after he holed out into the deep, granting Arshdeep his second wicket of the innings.</p></br><p>With 6 overs to go, Riyan Parag smashed the ball right from ball one, making things easier for his skipper at the other end. There was no shortage of entertainment as the Samson-Parag duo were on a roll, hammering 20 runs off the 16</span>th</span> over bowled by Murugan Ashwin. </p></br><p>With 48 required off the final four overs, skipper Rahul brought Shami back into the attack and the pacer scalped the vital wicket of Riyan Parag in his final over of the match.</p></br><p>There was no stopping the RR skipper though as the right-hander brought up a magnificent century, becoming the first batsman to get a hundred on IPL captaincy debut.</p></br><p>However, PBKS managed to dismiss Rahul Tewatia as Meredith picked his maiden IPL wicket in the penultimate over. </p></br><p>Samson had laid the foundation and now had the challenge to finish the innings for the team with 13 runs required off the final six deliveries.</p></br><p>Arshdeep, who had already scalped two wickets in the match was given the ultimate responsibility to bowl the final over. The left-arm pacer bowled phenomenally and varied his pace to perfection. With 5 runs required off the last ball, Samson sliced the ball in the air, into the deep and Deepak Hooda took a fine running catch, helping PBKS win the nail-biter of a match.</p>"
  },
  "match-6-rcb-srh": {
    "newsId": "match-6-rcb-srh",
    "title": "VIVO IPL 2021, MATCH 6 SRH VS RCB",
    "datetime": "2021-04-14T15:30:00.000Z",
    "datePublished": "April 14th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/14/c994a39d-241a-42b7-87e8-024a051df89b/Match06-_00871.JPG?width=2000&height=1333",
    "shortText": "Royal Challengers Bangalore produced a monumental comeback.",
    "detailedText": "<p>Royal Challengers Bangalore RCB won their second consecutive game after beating the Sunrisers Hyderabad SRH in Match 6 of the VIVO Indian Premier League IPL 2021 at the M. A. Chidambaram Stadium in Chennai on Wednesday.</p><br/><p>RCB produced a monumental comeback with the ball after Shahbaz Ahmed struck thrice in one over and managed to defend a total of 149 against SRH Chasing a total of 150 the SRH openers – David Warner and Wriddhiman Saha – got off to a cautious start scoring 13 in the first two overs.Mohammed Siraj built the pressure early on with the new ball forcing Saha to play a rash shot which went straight into the hands of Maxwell at backward point in the third over.</p><br/><p>However SRH attacked the pace of Kyle Jamieson smashing 17 off the 4th over with Warner and Manish Pandey hitting a six each.The SRH skipper shifted the gears and the fifty was up for the Sunrisers inside the powerplay.</p><br/><p> Both – Pandey and Warner – looked extremely comfortable in the middle and put the pressure on the RCB spinners.The fifty-run partnership was up between the two as RCB continued to search for. the breakthrough At the halfway mark SRH were 77/1 and were pacing the chase to perfection. Warner leading from the front then notched up his 49th half-century in IPL.</p><br/><p>However Jamieson provided RCB a much-needed breakthrough as he dismissed Warner in the 14th over.SRH though were still in control of the chase with 42 needed from the final five overs.RCB skipper Kohli then handed the ball to Shahbaz Ahmed in the 17th over and it turned out to be a match-changing move as the left-arm spinner scalped 3 wickets in an over.He dismissed Jonny Bairstow and Pandey on consecutive deliveries and then got Abdul Samad out on the final delivery with all three batsmen attempting to clear the ropes.The pressure built on SRH as they further lost two wickets.</p><br/> First Harshal Patel got rid of Vijay Shankar courtesy a running catch from Kohli in the 18th over and later Siraj dismissed Jason Holder after he holed out in the deep in the penultimate over.Harshal Patel had 16 runs to defend in the final over. While he bowled a no-ball he kept his composure and scalped two wickets helping RCB seal a stunning 6-run win."
  },
  "match-7-rr-dc": {
    "newsId": "match-7-rr-dc",
    "title": "VIVO IPL 2021, MATCH 7 RR VS DC",
    "datetime": "2021-04-15T15:30:00.000Z",
    "datePublished": "April 15th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/15/3f3482d9-aa5e-482c-bb6f-542e5b8d4436/9S6A7354.JPG?width=2000&height=1333",
    "shortText": "Chris Morris' 18-ball 36*-run cameo, which came on the back of David Miller's 62, took Rajasthan Royals home against Delhi Capitals.",
    "detailedText": "<p>Punjab Kings (PBKS) overcame a spirited Rajasthan Royals (RR) challenge, led by a sensational Sanju Samson, and emerged victorious in a high-scoring thriller in Match 4 of the VIVO Indian Premier League (IPL) 2021 at the Wankhede Stadium in Mumbai on Monday.  </p></br><p>PBKS skipper KL Rahul led from the front, with a defining knock of 91 before Arshdeep Singh defended 13 runs in the last over, helping the side seal a 4-run win.  </p></br><p>Chasing a humongous total of 221, RR needed a powerful and explosive start from their openers. But they were denied the same as Mohammad Shami and Arshdeep Singh held on to catches off their own bowling to dismiss Ben Stokes and Manan Vohra respectively.</p></br><p>Samson and Jos Buttler had a mountain of runs to climb, but they didn’t let the pressure of early wickets affect them.</p></br><p>Buttler counter-attacked Riley Meredith in the fourth over, welcoming the right-arm pacer in the IPL with four fours in a row. Sanju Samson then creamed two fours in the sixth over off Arshdeep as RR moved to 59/2 at the end of powerplay.</p></br><p>Jhye Richardson was back into the attack after conceding 13 runs in the first over and managed to get rid of the dangerous-looking Buttler, cleverly deceiving the right-hander with a slower delivery.</p></br><p>The RR skipper though, continued playing his shots with the help of his supreme timing and struck a fifty on his IPL captaincy debut.  </p></br><p>Shivam Dube, who joined Samson, had a short stay at the crease after he holed out into the deep, granting Arshdeep his second wicket of the innings.</p></br><p>With 6 overs to go, Riyan Parag smashed the ball right from ball one, making things easier for his skipper at the other end. There was no shortage of entertainment as the Samson-Parag duo were on a roll, hammering 20 runs off the 16</span>th</span> over bowled by Murugan Ashwin. </p></br><p>With 48 required off the final four overs, skipper Rahul brought Shami back into the attack and the pacer scalped the vital wicket of Riyan Parag in his final over of the match.</p></br><p>There was no stopping the RR skipper though as the right-hander brought up a magnificent century, becoming the first batsman to get a hundred on IPL captaincy debut.</p></br><p>However, PBKS managed to dismiss Rahul Tewatia as Meredith picked his maiden IPL wicket in the penultimate over. </p></br><p>Samson had laid the foundation and now had the challenge to finish the innings for the team with 13 runs required off the final six deliveries.</p></br><p>Arshdeep, who had already scalped two wickets in the match was given the ultimate responsibility to bowl the final over. The left-arm pacer bowled phenomenally and varied his pace to perfection. With 5 runs required off the last ball, Samson sliced the ball in the air, into the deep and Deepak Hooda took a fine running catch, helping PBKS win the nail-biter of a match.</p>"
  },
  "match-8-pbks-csk": {
    "newsId": "match-8-pbks-csk",
    "title": "VIVO IPL 2021, MATCH 8 PBKS VS CSK",
    "datetime": "2021-04-16T15:30:00.000Z",
    "datePublished": "April 16th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/16/1a56491c-5e97-42ea-884e-6d6536720ecb/9S6A7594.JPG?width=2000&height=1333",
    "shortText": "Deepak Chahar starred with the ball, scalping four wickets, and set up Chennai Super Kings' win over Punjab Kings.",
    "detailedText": "<p>The bowlers led from the front once again in the early stage of the season as Chennai Super Kings (CSK) secured their first victory of the VIVO Indian Premier League (IPL) 2021, beating Punjab Kings (PBKS) in Match 8 at the Wankhede Stadium in Mumbai on Friday.</p><br/><p>Deepak Chahar’s remarkable four-wicket haul helped CSK restrict PBKS to 106/8 before they chased down the target with more than four overs to spare.</p><br/><p>CSK made a cautious start with the bat, chasing 107. Nothing to take away though from the PBKS pacers – Mohammad Shami and Jhye Richardson – who were right on the money with the new ball, conceding only eight runs in the first three overs.</p><br/><p>Faf du Plessis then switched gears, smacking 2 fours and a perfectly executed scoop that went all the way for a maximum, scoring 14 off the fourth over by Richardson.</p><br/><p>Arshdeep Singh, the star from PBKS’ last game, came into action and dismissed the struggling Ruturaj Gaikwad after the right-hander holed out in the deep.</p><br/><p>Moeen Ali was the next man in, and the left-hander was right on the attack, creaming two boundaries off Riley Meredith to take CSK to 32/1 at the end of 6 overs.</p><br/><p>Both Ali and du Plessis kept rotating the strike without taking big risks as CSK sailed past fifty in the eighth over, in total control of the chase.</p><br/><p>At the halfway mark, CSK were going a touch over 6 runs per over with Moeen Ali doing the majority of hitting. The left-hander came out with positive intent as he smashed a couple of boundaries off the leader of the PBKS bowling attack, Mohammad Shami.</p><br/><p>Nothing seemed to work in PBKS’ favour after an overthrow in the 12</span>th</span> over went all the way for four. </p><br/><p>In the next over, Moeen Ali launched one off Murugan Ashwin, over long-on for a maximum. While he was caught in the deep in the same over, he ensured the damage was done after scoring 46 off 31 balls. </p><br/><p>Shami came in to bowl the 15</span>th</span> over and created some late damage for CSK after picking 2 wickets in 2 balls, dismissing Suresh Raina and Ambati Rayudu respectively.</p><br/><p>With 4 runs required, Sam Curran finished off the chase in style, with a boundary and CSK chased down the total.</p>"
  },
  "match-9-mi-srh": {
    "newsId": "match-9-mi-srh",
    "title": "VIVO IPL 2021, MATCH 9 MI VS SRH",
    "datetime": "2021-04-17T15:30:00.000Z",
    "datePublished": "April 17th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/17/3ad87463-492d-4f96-80fe-bc1d51541402/Match09-_00797.JPG?width=2000&height=1333",
    "shortText": "Rahul Chahar delivered once again with the ball for Mumbai Indians as they made an impressive comeback into the game and defended their total of 150/5 against Sunrisers Hyderabad.",
    "detailedText": "<p>Mumbai Indians (MI) registered their second consecutive victory in the season after beating the Sunrisers Hyderabad (SRH) in Match 9 of the VIVO Indian Premier League (IPL) 2021 at the M. A Chidambaram Stadium in Chennai on Saturday.</p><br/><p>Rahul Chahar delivered once again with the ball while Hardik Pandya’s fielding brilliance including a couple of direct hits on the field  encouraged an impressive comeback into the game and defended their total of 150/5 against SRH.</p><br/><p>Chasing 150, Jonny Bairstow, who was back in the role of the opener, and David Warner were watchful against the duo of Trent Boult and Jasprit Bumrah in the first two overs. </p><br/><p>However, Bairstow didn’t hold back for too long, as he hammered 18 runs off the third over, smacking three fours and a six off Boult, bringing his stand and deliver ability into the chase.</p><br/><p>The right-hander then went after MI debutant Adam Milne and scored 19 off the fourth over, adding two more sixes to the count. </p><br/><p>SRH made the most out of the powerplay, scoring 57/0 in the 6 overs, with Bairstow striking the ball as clean as anyone else. </p><br/><p>The right-hander got out in an anticlimactic way - a hit-wicket dismissal that provided MI a breakthrough out of nowhere.</p><br/><p>MI cleverly capitalised on that Bairstow dismissal and brought Rahul Chahar into the attack. The leg-spinner managed to dismiss Manish Pandey for 2 to bring MI right back into the contest.</p><br/><p>SRH were 74/2 at the 10-overs mark as Warner continued playing his shots against the MI spinners before the SRH skipper fell victim to an excellent direct-hit from Hardik Pandya inside the circle that ended his innings of 36.</p><br/><p>Milne made an impressive comeback and considered only 6 runs in the 14th over as Vijay Shankar and Virat Singh were placed in a tricky situation in the chase. </p><br/><p>In the next over, Chahar scalped two wickets, dismissing Virat and Abhishek Sharma in the same over, with both batsmen trying to take on the leg-spinner. </p><br/><p>Shankar brought some hope into the SRH chase after smacking Krunal Pandya for consecutive sixes as Sunrisers required 31 off the final four overs, with Abdul Samad at other end. </p><br/><p>Bumrah bowled the 17th over and conceded only four runs as SRH tried taking the chase deep. Another bullet-throw from Hardik in the game ended Samad’s innings. </p><br/><p>With 21 required off the final two, Bumrah got the crucial wicket of Shankar in the penultimate over and Boult castled Bhuvneshwar Kumar and Khaleel Ahmed in the final over that meant SRH were bundled out for 137.</p>"
  },
  "match-10-rcb-kkr": {
    "newsId": "match-10-rcb-kkr",
    "title": "VIVO IPL 2021, MATCH 10 RCB VS KKR",
    "datetime": "2021-04-18T15:30:00.000Z",
    "datePublished": "April 18th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/18/c9be848e-3fe2-488d-badc-47dea312ec22/VRP1066.jpg?width=2000&height=1333",
    "shortText": "The Virat Kohli-led Royal Challengers Bangalore registered a hat-trick of wins after beating Kolkata Knight Riders by 38 runs.",
    "detailedText": "<p>Royal Challengers Bangalore registered their third win on the bounce after beating Kolkata Knight Riders (KKR) in Match 10 of the VIVO Indian Premier League (IPL) 2021 at the M. A Chidambaram Stadium in Chennai on Sunday.</p><br/><p>Glenn Maxwell’s explosiveness and AB de Villiers’ clean hitting was on full display as RCB put forward a commanding total of 204/4 and successfully defended the same against KKR, who fell short of the target by 38 runs.</p><br/><p>KKR, who remained unchanged from their previous defeat, had a massive target of 205 to chase and needed an explosive start from openers – Nitish Rana and Shubman Gill.</p><br/><p>Gill went berserk in the second over, clobbering two sixes and a four to Kyle Jamieson before the right-arm pacer got the KKR opener in an eventful over, thanks to a diving catch from Dan Christian at mid-on.  </p><br/><p>Tripathi, who walked in at 3 ,went after the RCB attack right from ball one and smashed 4 boundaries. But Washington Sundar got Tripathi caught near square-leg at the end of powerplay, with KKR 57-2 after 6 overs.</p><br/><p>Rana went after Chahal straightway and hit the leg-spinner for two boundaries in an over but the trend of six and out continued for KKR as Rana tried to hit one more out of the park, only to find Devdutt Padikkal in the outfield as Chahal scalped his first wicket of the season.</p><br/><p>KKR were completely on the backfoot and Chahal made the KKR feel that pressure with dot balls. Dinesh Karthik was the next man to be dismissed after getting rapped on the front pad, facing Chahal and KKR were 83-4 at the 10-overs mark.</p><br/><p>Eoin Morgan, the KKR skipper, was still out in the middle, along with Shakib Al Hasan as the duo built a steady partnership and added 24 in the next three overs.</p><br/><p>Both Morgan and Shakib targeted Maxwell and hit a six each in the 13</span>th</span> over but the KKR skipper departed after he was caught by Virat Kohli at extra-cover off Harshal Patel who got the vital wicket of Morgan.</p><br/><p>With 79 required off the final four, Andre Russell, who joined Shakib at the crease, hammered Chahal for 20 runs, smacking three boundaries and a six to the leg-spinner.</p><br/><p>The West-Indian all-rounder further crunched Jamieson for a six but the right-arm seamer finished on a high note after hitting the timber to dismiss Shakib and then got Cummins caught behind on the final ball.</p><br/><p>KKR required 44 off 12 deliveries as Mohammad Siraj bowled an exceptional penultimate over to Russell, giving away just 1 run and prevented Russell from opening his arms.</p><br/><p>Harshal bowled the final over and rattled Russell’s stumps and it was game over for KKR as RCB won by 38 runs to complete a hat-trick of wins.</p>"
  },
  "match-11-dc-pbks": {
    "newsId": "match-11-dc-pbks",
    "title": "VIVO IPL 2021, MATCH 11 DC VS PBKS",
    "datetime": "2021-04-19T15:30:00.000Z",
    "datePublished": "April 19th 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/18/749e8bd7-14f0-4a44-ab76-04efcdf29c03/DMIPL5409.JPG?width=2000&height=1333",
    "shortText": "Shikhar Dhawan scored a magnificent 92 as Delhi Capitals beat Punjab Kings by six wickets.",
    "detailedText": "<p>Delhi Capitals (DC) bounced back with a victory after beating the Punjab Kings (PBKS) in Match 11 of the VIVO Indian Premier League (IPL) 2021 at the Wankhede Stadium in Mumbai on Sunday.</p><br/><p>Shikhar Dhawan’s magnificent 92(49) at the top helped DC edge out PBKS as they chased down the target of 196 in a run-fest at Wankhede.</p><br/><p>In the chase, the DC openers got off to the desired start, with Dhawan and Prithvi Shaw taking on the new ball and adding 21 runs in the first two overs.</p><br/><p>Shaw took charge of the attack as he lofted Mohammad Shami for a six over long-on in the second over. The DC openers then hit a couple of fours off Jalaj Saxena, who came in to bowl the third over.</p><br/><p>DC were going at over 10 runs per over at the start and Shaw went after the length deliveries of Jhye Richardson as he flicked the pacer towards the leg side for four and then lofted him over long-off for maximum.</p><br/><p>It was then time for Dhawan to exhibit his range of shots after hitting Shami for three fours in an over. PBKS got rid of the dangerous Shaw and the short ball did the trick for Arshdeep Singh as the right-hander edged one to Gayle at square-leg.</p><br/><p>Steve Smith joined Dhawan in the middle as the two worked around the ball and played out a couple of quiet overs, with Deepak Hooda and Saxena bowling from each ends.</p><br/><p>Dhawan then broke the shackles and hit two consecutive fours off Hooda before notching up a half-century. In the 10</span>th</span> over, he launched a maximum off Richardson as DC moved to 99/1 at the halfway stage of the chase.</p><br/><p>Riley Meredith’s short ball did the trick for PBKS, as he dismissed Steve Smith for 9.</p><br/><p>Dhawan carried his rhythm and accelerated by smashing Shami over long-on for a six and then creamed three fours in a row off Meredith in the 14</span>th</span> over, helping DC score 18 runs in that over.  </p><br/><p>Rishabh Pant joined the party and smashed his first six of the game before Richardson brought an end to Dhawan’s fine knock of 92 after the DC batsman played a premeditated shot to a delivery that crashed into the stumps.</p><br/><p>DC got close to the target but the job was yet to be done as they required 36 off the final four overs.  </p><br/><p>Shami bowled a long 17th over that included a front-foot no ball followed by a delivery that was above waist height.</p><br/><p>Stoinis made full use of the free hits, hitting two fours and a six to bring up 20 off the over.</p><br/><p>However, Richardson scalped his second wicket in form of the DC skipper, who miscued the shot that went straight to Hooda at long-on, who took a juggling catch.</p><br/><p>Lalit Yadav, who walked out to bat after Pant’s fall, supported Stonis with 2 boundaries after the latter finished the run-chase in style with a boundary and DC chased the total of 195.</p>"
  },
  "match-12-csk-rr": {
    "newsId": "match-12-csk-rr",
    "title": "VIVO IPL 2021, MATCH 12 CSK VS RR",
    "datetime": "2021-04-21T15:30:00.000Z",
    "datePublished": "April 21st 2021, 9:30 pm",
    "newsImageUrl": "https://resources.platform.iplt20.com/photo-resources/2021/04/19/86c2f801-9d7c-4191-9301-64692e400083/DMIPL7401.JPG?width=2000&height=1333",
    "shortText": "Moeen Ali scalped trhee wickets, conceding just 7 runs, as Chennai Super Kings beat Rajasthan Royals by 45 runs to seal their second win of the season.",
    "detailedText": "<p>Chennai Super Kings (CSK) registered their second consecutive victory in the season after beating Rajasthan Royals (RR) by 45 runs in Match 12 of the VIVO Indian Premier League (IPL) 2021 at the Wankhede Stadium in Mumbai on Monday.</p><br/><p>Moeen Ali starred with the ball while Ravindra Jadeja grabbed 4 catches, adding to his two crucial breakthroughs that powered CSK to a comprehensive win over RR.</p><br/><p>Chasing a target of 189, RR openers Manan Vohra and Jos Buttler got off to a solid start, scoring 11 runs off Deepak Chahar in the first over before Sam Curran bowled a tight second over.</p><br/><p>Vohra then took on a short one and deposited Curran for a maximum before the right-hander holed out to deep mid-wicket, providing CSK their first breakthrough in the fourth over.</p><br/><p>Buttler on the other end, played fearless shots and attacked the pace of Chahar straight down the ground, with a four and a six off the wicketkeeper batsman’s blade.</p><br/><p>However, Curran managed to get the RR skipper Sanju Samson out cheaply with a slower one as RR ended their powerplay with a total of 45/2 on board.</p><br/><p>Shivam Dube joined Buttler at the crease and the duo steadily played the middle-overs, with Buttler playing the aggressor role. The right-hander put away Jadeja’s deliveries for two fours and later smacked a six off a free-hit.</p><br/><p>RR were placed at 81/2 at the 10-over mark and that’s when the game turned around completely in CSK’s favour.</p><br/><p>It all started with Jadeja castling Buttler’s stumps that landed in the perfect stop as the right-hander fell one short of a fifty. The CSK all-rounder then trapped Dube in front, in the same over.</p><br/><p>David Miller, who was the hero of RR’s previous game, could only score 2 runs this time around after Moeen Ali got the left-hander out for LBW.</p><br/><p>The right-arm spinner then picked two wickets in the 15</span>th</span> over, with both dismissals almost identical to each other. Riyan Parag and Chris Morris tried to launch Ali out of the park but ended up handing it straight to Jadeja at deep mid-wicket. </p><br/><p>With the pressure of chasing a big total, RR collapsed in no time and lost vital wickets in the middle-overs, slipping to 95/7. </p><br/><p>Rahul Tewatia (20) and Jaydev Unadkat (24) helped RR recover to a certain extent and smashed 3 sixes between them before becoming victims of the slower balls by Bravo and Shardul Thakur respectively as CSK sealed a win.</p>"
  }
}